{
  "title": "Terms & Conditions",
  "last_updated": "2025-01-27",
  "content": [
    { "type": "h1", "text": "Terms & Conditions" },
    { "type": "p", "text": "By accessing or using the AdtU Bus XQ platform (web or mobile), you agree to the following Terms & Conditions. Please read carefully." },
    { "type": "h2", "text": "1. Introduction & Acceptance" },
    { "type": "p", "text": "AdtU Bus XQ is an official campus transportation management system of Assam Down Town University. Use of this platform indicates that you accept these terms. If you do not agree, do not use the system." },
    { "type": "h2", "text": "2. User Roles" },
    { "type": "p", "text": "Student: View assigned bus/route, track bus, receive notifications, check-in." },
    { "type": "p", "text": "Driver: Update live location, manage trip status, send alerts." },
    { "type": "p", "text": "Moderator: Monitor operations, approve requests, manage exceptions." },
    { "type": "p", "text": "Admin: Manage users, routes, buses, notifications, and system settings." },
    { "type": "h2", "text": "3. Eligibility & Registration" },
    { "type": "p", "text": "Only authorized AdtU members may use this platform. Users must provide accurate personal and academic details. Accounts are linked to official university identity." },
    { "type": "h2", "text": "4. Data Collection & Usage" },
    { "type": "p", "text": "The system collects name, contact, department, shift, bus/route details, real-time location (for drivers), and usage logs. This data is used only for transportation management, safety, and communication. AdtU may store and process this data securely." },
    { "type": "h2", "text": "5. Bus Usage Rules" },
    { "type": "p", "text": "Students must board only their assigned bus." },
    { "type": "p", "text": "Arrive at stops on time." },
    { "type": "p", "text": "Respect driver and university staff." },
    { "type": "p", "text": "No vandalism, harassment, or unsafe behavior." },
    { "type": "p", "text": "Follow university policies and local laws." },
    { "type": "h2", "text": "6. Attendance & Check-in" },
    { "type": "p", "text": "Check-in may be required for seat reservation or attendance. Failure to check-in or repeated absence may result in warnings or removal from service." },
    { "type": "h2", "text": "7. Prohibited Activities" },
    { "type": "p", "text": "You must not:" },
    { "type": "p", "text": "Share account access." },
    { "type": "p", "text": "Provide false information." },
    { "type": "p", "text": "Tamper with location or system data." },
    { "type": "p", "text": "Misuse notifications or chat features." },
    { "type": "p", "text": "Attempt to hack or disrupt the system." },
    { "type": "h2", "text": "8. Location Tracking & Privacy" },
    { "type": "p", "text": "Driver location is tracked in real-time for navigation, safety, and student visibility. Student location is only recorded when voluntarily shared (e.g., waiting flag or check-in). All data is handled per university privacy standards." },
    { "type": "h2", "text": "9. Notifications & Communication" },
    { "type": "p", "text": "The system may send alerts regarding delays, route changes, safety notices, or emergencies. By using the platform, you consent to receive such notifications." },
    { "type": "h2", "text": "10. Liability & Safety Disclaimer" },
    { "type": "p", "text": "AdtU strives to maintain accurate schedules and safe operations but is not liable for delays, technical issues, accidents, or indirect damages. Users are responsible for personal safety and behavior while traveling." },
    { "type": "h2", "text": "11. System Availability & Changes" },
    { "type": "p", "text": "AdtU may update routes, schedules, features, or temporarily suspend the service for maintenance or operational reasons without prior notice." },
    { "type": "h2", "text": "12. Termination of Access" },
    { "type": "p", "text": "AdtU reserves the right to suspend or terminate any user account for rule violations, misuse, or disciplinary reasons. All decisions by the university are final." },
    { "type": "h2", "text": "13. Consent & Agreement" },
    { "type": "p", "text": "By using AdtU Bus XQ, you confirm that you have read, understood, and agreed to all terms above. Continued use indicates ongoing acceptance of any future updates to these Terms & Conditions." }
  ]
}